; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l4-t1-p18---int100n150-m25---int100c150---s554---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 - fuellevel
)

(:init
(sum level0 level4 level4)
(sum level0 level5 level5)
(sum level0 level7 level7)
(sum level0 level19 level19)
(sum level0 level23 level23)
(sum level1 level4 level5)
(sum level1 level5 level6)
(sum level1 level7 level8)
(sum level1 level19 level20)
(sum level1 level23 level24)
(sum level2 level4 level6)
(sum level2 level5 level7)
(sum level2 level7 level9)
(sum level2 level19 level21)
(sum level2 level23 level25)
(sum level3 level4 level7)
(sum level3 level5 level8)
(sum level3 level7 level10)
(sum level3 level19 level22)
(sum level3 level23 level26)
(sum level4 level4 level8)
(sum level4 level5 level9)
(sum level4 level7 level11)
(sum level4 level19 level23)
(sum level4 level23 level27)
(sum level5 level4 level9)
(sum level5 level5 level10)
(sum level5 level7 level12)
(sum level5 level19 level24)
(sum level5 level23 level28)
(sum level6 level4 level10)
(sum level6 level5 level11)
(sum level6 level7 level13)
(sum level6 level19 level25)
(sum level6 level23 level29)
(sum level7 level4 level11)
(sum level7 level5 level12)
(sum level7 level7 level14)
(sum level7 level19 level26)
(sum level7 level23 level30)
(sum level8 level4 level12)
(sum level8 level5 level13)
(sum level8 level7 level15)
(sum level8 level19 level27)
(sum level8 level23 level31)
(sum level9 level4 level13)
(sum level9 level5 level14)
(sum level9 level7 level16)
(sum level9 level19 level28)
(sum level9 level23 level32)
(sum level10 level4 level14)
(sum level10 level5 level15)
(sum level10 level7 level17)
(sum level10 level19 level29)
(sum level10 level23 level33)
(sum level11 level4 level15)
(sum level11 level5 level16)
(sum level11 level7 level18)
(sum level11 level19 level30)
(sum level11 level23 level34)
(sum level12 level4 level16)
(sum level12 level5 level17)
(sum level12 level7 level19)
(sum level12 level19 level31)
(sum level12 level23 level35)
(sum level13 level4 level17)
(sum level13 level5 level18)
(sum level13 level7 level20)
(sum level13 level19 level32)
(sum level13 level23 level36)
(sum level14 level4 level18)
(sum level14 level5 level19)
(sum level14 level7 level21)
(sum level14 level19 level33)
(sum level14 level23 level37)
(sum level15 level4 level19)
(sum level15 level5 level20)
(sum level15 level7 level22)
(sum level15 level19 level34)
(sum level15 level23 level38)
(sum level16 level4 level20)
(sum level16 level5 level21)
(sum level16 level7 level23)
(sum level16 level19 level35)
(sum level16 level23 level39)
(sum level17 level4 level21)
(sum level17 level5 level22)
(sum level17 level7 level24)
(sum level17 level19 level36)
(sum level17 level23 level40)
(sum level18 level4 level22)
(sum level18 level5 level23)
(sum level18 level7 level25)
(sum level18 level19 level37)
(sum level18 level23 level41)
(sum level19 level4 level23)
(sum level19 level5 level24)
(sum level19 level7 level26)
(sum level19 level19 level38)
(sum level19 level23 level42)
(sum level20 level4 level24)
(sum level20 level5 level25)
(sum level20 level7 level27)
(sum level20 level19 level39)
(sum level20 level23 level43)
(sum level21 level4 level25)
(sum level21 level5 level26)
(sum level21 level7 level28)
(sum level21 level19 level40)
(sum level21 level23 level44)
(sum level22 level4 level26)
(sum level22 level5 level27)
(sum level22 level7 level29)
(sum level22 level19 level41)
(sum level22 level23 level45)
(sum level23 level4 level27)
(sum level23 level5 level28)
(sum level23 level7 level30)
(sum level23 level19 level42)
(sum level23 level23 level46)
(sum level24 level4 level28)
(sum level24 level5 level29)
(sum level24 level7 level31)
(sum level24 level19 level43)
(sum level25 level4 level29)
(sum level25 level5 level30)
(sum level25 level7 level32)
(sum level25 level19 level44)
(sum level26 level4 level30)
(sum level26 level5 level31)
(sum level26 level7 level33)
(sum level26 level19 level45)
(sum level27 level4 level31)
(sum level27 level5 level32)
(sum level27 level7 level34)
(sum level27 level19 level46)
(sum level28 level4 level32)
(sum level28 level5 level33)
(sum level28 level7 level35)
(sum level29 level4 level33)
(sum level29 level5 level34)
(sum level29 level7 level36)
(sum level30 level4 level34)
(sum level30 level5 level35)
(sum level30 level7 level37)
(sum level31 level4 level35)
(sum level31 level5 level36)
(sum level31 level7 level38)
(sum level32 level4 level36)
(sum level32 level5 level37)
(sum level32 level7 level39)
(sum level33 level4 level37)
(sum level33 level5 level38)
(sum level33 level7 level40)
(sum level34 level4 level38)
(sum level34 level5 level39)
(sum level34 level7 level41)
(sum level35 level4 level39)
(sum level35 level5 level40)
(sum level35 level7 level42)
(sum level36 level4 level40)
(sum level36 level5 level41)
(sum level36 level7 level43)
(sum level37 level4 level41)
(sum level37 level5 level42)
(sum level37 level7 level44)
(sum level38 level4 level42)
(sum level38 level5 level43)
(sum level38 level7 level45)
(sum level39 level4 level43)
(sum level39 level5 level44)
(sum level39 level7 level46)
(sum level40 level4 level44)
(sum level40 level5 level45)
(sum level41 level4 level45)
(sum level41 level5 level46)
(sum level42 level4 level46)

(connected l0 l1)
(fuelcost level19 l0 l1)
(connected l0 l2)
(fuelcost level7 l0 l2)
(connected l0 l3)
(fuelcost level23 l0 l3)
(connected l1 l0)
(fuelcost level19 l1 l0)
(connected l1 l2)
(fuelcost level5 l1 l2)
(connected l1 l3)
(fuelcost level4 l1 l3)
(connected l2 l0)
(fuelcost level7 l2 l0)
(connected l2 l1)
(fuelcost level5 l2 l1)
(connected l2 l3)
(fuelcost level4 l2 l3)
(connected l3 l0)
(fuelcost level23 l3 l0)
(connected l3 l1)
(fuelcost level4 l3 l1)
(connected l3 l2)
(fuelcost level4 l3 l2)

(at t0 l3)
(fuel t0 level46)
(= (total-cost) 0)

(at p0 l0)
(at p1 l3)
(at p2 l1)
(at p3 l1)
(at p4 l3)
(at p5 l1)
(at p6 l2)
(at p7 l0)
(at p8 l2)
(at p9 l0)
(at p10 l3)
(at p11 l1)
(at p12 l0)
(at p13 l2)
(at p14 l2)
(at p15 l3)
(at p16 l2)
(at p17 l1)
)

(:goal
(and
(at p0 l2)
(at p1 l2)
(at p2 l2)
(at p3 l0)
(at p4 l0)
(at p5 l0)
(at p6 l1)
(at p7 l2)
(at p8 l0)
(at p9 l2)
(at p10 l2)
(at p11 l3)
(at p12 l2)
(at p13 l3)
(at p14 l0)
(at p15 l0)
(at p16 l1)
(at p17 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p10 t0 l3)
   deleted: (at p10 l3)
   added: (in p10 t0)
   goals met: 0 of 18
2. (drive t0 l3 l2 level42 level4 level46)
   deleted: (at t0 l3) (fuel t0 level46)
   added: (at t0 l2) (fuel t0 level42)
   goals met: 0 of 18
3. (unload p10 t0 l2)
   deleted: (in p10 t0)
   added: (at p10 l2)
   goals met: 1 of 18
4. (load p8 t0 l2)
   deleted: (at p8 l2)
   added: (in p8 t0)
   goals met: 1 of 18
5. (load p6 t0 l2)
   deleted: (at p6 l2)
   added: (in p6 t0)
   goals met: 1 of 18
6. (load p16 t0 l2)
   deleted: (at p16 l2)
   added: (in p16 t0)
   goals met: 1 of 18
7. (load p14 t0 l2)
   deleted: (at p14 l2)
   added: (in p14 t0)
   goals met: 1 of 18
8. (load p13 t0 l2)
   deleted: (at p13 l2)
   added: (in p13 t0)
   goals met: 1 of 18
9. (drive t0 l2 l1 level37 level5 level42)
   deleted: (at t0 l2) (fuel t0 level42)
   added: (at t0 l1) (fuel t0 level37)
   goals met: 1 of 18
10. (unload p6 t0 l1)
   deleted: (in p6 t0)
   added: (at p6 l1)
   goals met: 2 of 18
11. (unload p16 t0 l1)
   deleted: (in p16 t0)
   added: (at p16 l1)
   goals met: 3 of 18
12. (load p5 t0 l1)
   deleted: (at p5 l1)
   added: (in p5 t0)
   goals met: 3 of 18
13. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 3 of 18
14. (load p2 t0 l1)
   deleted: (at p2 l1)
   added: (in p2 t0)
   goals met: 3 of 18
15. (load p17 t0 l1)
   deleted: (at p17 l1)
   added: (in p17 t0)
   goals met: 3 of 18
16. (load p11 t0 l1)
   deleted: (at p11 l1)
   added: (in p11 t0)
   goals met: 3 of 18
17. (drive t0 l1 l3 level33 level4 level37)
   deleted: (at t0 l1) (fuel t0 level37)
   added: (at t0 l3) (fuel t0 level33)
   goals met: 3 of 18
18. (unload p13 t0 l3)
   deleted: (in p13 t0)
   added: (at p13 l3)
   goals met: 4 of 18
19. (unload p11 t0 l3)
   deleted: (in p11 t0)
   added: (at p11 l3)
   goals met: 5 of 18
20. (load p4 t0 l3)
   deleted: (at p4 l3)
   added: (in p4 t0)
   goals met: 5 of 18
21. (load p15 t0 l3)
   deleted: (at p15 l3)
   added: (in p15 t0)
   goals met: 5 of 18
22. (load p1 t0 l3)
   deleted: (at p1 l3)
   added: (in p1 t0)
   goals met: 5 of 18
23. (drive t0 l3 l0 level10 level23 level33)
   deleted: (at t0 l3) (fuel t0 level33)
   added: (at t0 l0) (fuel t0 level10)
   goals met: 5 of 18
24. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 5 of 18
25. (load p12 t0 l0)
   deleted: (at p12 l0)
   added: (in p12 t0)
   goals met: 5 of 18
26. (load p7 t0 l0)
   deleted: (at p7 l0)
   added: (in p7 t0)
   goals met: 5 of 18
27. (load p9 t0 l0)
   deleted: (at p9 l0)
   added: (in p9 t0)
   goals met: 5 of 18
28. (unload p14 t0 l0)
   deleted: (in p14 t0)
   added: (at p14 l0)
   goals met: 6 of 18
29. (unload p15 t0 l0)
   deleted: (in p15 t0)
   added: (at p15 l0)
   goals met: 7 of 18
30. (unload p3 t0 l0)
   deleted: (in p3 t0)
   added: (at p3 l0)
   goals met: 8 of 18
31. (unload p4 t0 l0)
   deleted: (in p4 t0)
   added: (at p4 l0)
   goals met: 9 of 18
32. (unload p5 t0 l0)
   deleted: (in p5 t0)
   added: (at p5 l0)
   goals met: 10 of 18
33. (unload p8 t0 l0)
   deleted: (in p8 t0)
   added: (at p8 l0)
   goals met: 11 of 18
34. (drive t0 l0 l2 level3 level7 level10)
   deleted: (at t0 l0) (fuel t0 level10)
   added: (at t0 l2) (fuel t0 level3)
   goals met: 11 of 18
35. (unload p0 t0 l2)
   deleted: (in p0 t0)
   added: (at p0 l2)
   goals met: 12 of 18
36. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 13 of 18
37. (unload p12 t0 l2)
   deleted: (in p12 t0)
   added: (at p12 l2)
   goals met: 14 of 18
38. (unload p17 t0 l2)
   deleted: (in p17 t0)
   added: (at p17 l2)
   goals met: 15 of 18
39. (unload p2 t0 l2)
   deleted: (in p2 t0)
   added: (at p2 l2)
   goals met: 16 of 18
40. (unload p7 t0 l2)
   deleted: (in p7 t0)
   added: (at p7 l2)
   goals met: 17 of 18
41. (unload p9 t0 l2)
   deleted: (in p9 t0)
   added: (at p9 l2)
   goals met: 18 of 18
